app/controllers/whales_controller.rb

SELECT "whales".* FROM "whales"
---
  def index
    @whales = Whale.all

INSERT INTO "whales" ("name", "facts", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Falcon"], ["facts", "asesino"], ["created_at", "2024-07-10 19:47:04.608571"], ["updated_at", "2024-07-10 19:47:04.608571"]]
---
  def create
    @whale = Whale.new(whale_params)

    respond_to do |format|
      if @whale.save

DELETE FROM "whales" WHERE "whales"."id" = ?  [["id", 1]]
---
  def destroy
    @whale.destroy

SELECT "whales".* FROM "whales" WHERE "whales"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_whale
      @whale = Whale.find(params[:id])